app/controllers/api/tasks_controller.rb

INSERT INTO "tasks" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["body", "im the body"], ["done", false], ["created_at", "2019-04-23 22:42:52.657025"], ["updated_at", "2019-04-23 22:42:52.657025"]]
---
  def create
    @task = Task.new(task_params)
    if @task.save